SFeli/ESP32_IDF_BMP2/main/bmp2_defs.h
/**
* Copyright (c) 2021 Bosch Sensortec GmbH. All rights reserved.
*
* BSD-3-Clause
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1. Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
* 2. Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
* 3. Neither the name of the copyright holder nor the names of its
*    contributors may be used to endorse or promote products derived from
*    this software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
* "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
* LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
* FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
* COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
* STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
* IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
* @file       bmp2_defs.h
* @date       2021-05-21
* @version    v1.0.1
*
*/

/*! @file bmp2_defs.h
 * @brief Sensor driver for BMP2 sensor
 */

#ifndef _BMP2_DEFS_H
#define _BMP2_DEFS_H

/*! CPP guard */
#ifdef __cplusplus
extern "C" {
#endif

/****************************************************************/
/*! @name       Header includes             */
/****************************************************************/
#ifdef __KERNEL__
#include <linux/types.h>
#include <linux/kernel.h>
#else
#include <stdint.h>
#include <stddef.h>
#endif

/****************************************************************/
/*! @name       Common macros               */
/****************************************************************/
#ifdef __KERNEL__
#if !defined(UINT8_C) && !defined(INT8_C)
#define INT8_C(x)    S8_C(x)
#define UINT8_C(x)   U8_C(x)
#endif

#if !defined(UINT16_C) && !defined(INT16_C)
#define INT16_C(x)   S16_C(x)
#define UINT16_C(x)  U16_C(x)
#endif

#if !defined(INT32_C) && !defined(UINT32_C)
#define INT32_C(x)   S32_C(x)
#define UINT32_C(x)  U32_C(x)
#endif

#if !defined(INT64_C) && !defined(UINT64_C)
#define INT64_C(x)   S64_C(x)
#define UINT64_C(x)  U64_C(x)
#endif
#endif

/*! @name C standard macros */
#ifndef NULL
#ifdef __cplusplus
#define NULL         0
#else
#define NULL         ((void *) 0)
#endif
#endif

/******************************************************************************/
/*! @name        Compiler switch macros Definitions                */
/******************************************************************************/
#ifndef BMP2_64BIT_COMPENSATION /*< Check if 64bit (using BMP2_64BIT_COMPENSATION) is enabled */
#ifndef BMP2_32BIT_COMPENSATION /*< Check if 32bit (using BMP2_32BIT_COMPENSATION) is enabled */
#ifndef BMP2_DOUBLE_COMPENSATION /*< If any of the integer data types not enabled then enable
                                    * BMP2_DOUBLE_COMPENSATION */
#define BMP2_DOUBLE_COMPENSATION
#endif
#endif
#endif

/******************************************************************************/
/*! @name        General Macro Definitions                */
/******************************************************************************/

/*! @name Maximum write length to registers */
#define BMP2_MAX_LEN                                  UINT8_C(4)

/*! @name Return codes */
/*! @name Success code*/
#define BMP2_OK                                       INT8_C(0)

/*! @name Error codes */
#define BMP2_E_NULL_PTR                               INT8_C(-1)
#define BMP2_E_COM_FAIL                               INT8_C(-2)
#define BMP2_E_INVALID_LEN                            INT8_C(-3)
#define BMP2_E_DEV_NOT_FOUND                          INT8_C(-4)
#define BMP2_E_UNCOMP_TEMP_RANGE                      INT8_C(-5)
#define BMP2_E_UNCOMP_PRESS_RANGE                     INT8_C(-6)
#define BMP2_E_UNCOMP_TEMP_AND_PRESS_RANGE            INT8_C(-7)

/*! @name Warning codes */
#define BMP2_W_MIN_TEMP                               INT8_C(1)
#define BMP2_W_MAX_TEMP                               INT8_C(2)
#define BMP2_W_MIN_PRES                               INT8_C(3)
#define BMP2_W_MAX_PRES                               INT8_C(4)

/*! @name Chip ID */
#define BMP2_CHIP_ID                                  UINT8_C(0x58)

/*! @name I2C addresses */
#define BMP2_I2C_ADDR_PRIM                            UINT8_C(0x76)
#define BMP2_I2C_ADDR_SEC                             UINT8_C(0x77)

/*! @name Register addresses */
#define BMP2_REG_CHIP_ID                              UINT8_C(0xD0)
#define BMP2_REG_SOFT_RESET                           UINT8_C(0xE0)
#define BMP2_REG_STATUS                               UINT8_C(0xF3)
#define BMP2_REG_CTRL_MEAS                            UINT8_C(0xF4)
#define BMP2_REG_CONFIG                               UINT8_C(0xF5)
#define BMP2_REG_PRES_MSB                             UINT8_C(0xF7)
#define BMP2_REG_PRES_LSB                             UINT8_C(0xF8)
#define BMP2_REG_PRES_XLSB                            UINT8_C(0xF9)
#define BMP2_REG_TEMP_MSB                             UINT8_C(0xFA)
#define BMP2_REG_TEMP_LSB                             UINT8_C(0xFB)
#define BMP2_REG_TEMP_XLSB                            UINT8_C(0xFC)

/* Calibration parameter register addresses */
#define BMP2_REG_DIG_T1_LSB                           UINT8_C(0x88)
#define BMP2_REG_DIG_T1_MSB                           UINT8_C(0x89)
#define BMP2_REG_DIG_T2_LSB                           UINT8_C(0x8A)
#define BMP2_REG_DIG_T2_MSB                           UINT8_C(0x8B)
#define BMP2_REG_DIG_T3_LSB                           UINT8_C(0x8C)
#define BMP2_REG_DIG_T3_MSB                           UINT8_C(0x8D)
#define BMP2_REG_DIG_P1_LSB                           UINT8_C(0x8E)
#define BMP2_REG_DIG_P1_MSB                           UINT8_C(0x8F)
#define BMP2_REG_DIG_P2_LSB                           UINT8_C(0x90)
#define BMP2_REG_DIG_P2_MSB                           UINT8_C(0x91)
#define BMP2_REG_DIG_P3_LSB                           UINT8_C(0x92)
#define BMP2_REG_DIG_P3_MSB                           UINT8_C(0x93)
#define BMP2_REG_DIG_P4_LSB                           UINT8_C(0x94)
#define BMP2_REG_DIG_P4_MSB                           UINT8_C(0x95)
#define BMP2_REG_DIG_P5_LSB                           UINT8_C(0x96)
#define BMP2_REG_DIG_P5_MSB                           UINT8_C(0x97)
#define BMP2_REG_DIG_P6_LSB                           UINT8_C(0x98)
#define BMP2_REG_DIG_P6_MSB                           UINT8_C(0x99)
#define BMP2_REG_DIG_P7_LSB                           UINT8_C(0x9A)
#define BMP2_REG_DIG_P7_MSB                           UINT8_C(0x9B)
#define BMP2_REG_DIG_P8_LSB                           UINT8_C(0x9C)
#define BMP2_REG_DIG_P8_MSB                           UINT8_C(0x9D)
#define BMP2_REG_DIG_P9_LSB                           UINT8_C(0x9E)
#define BMP2_REG_DIG_P9_MSB                           UINT8_C(0x9F)

