SFeli/ESP32_IDF_BMP2/main/bmp2_defs.h
    /*! Calibration t1 data */
    uint16_t dig_t1;

    /*! Calibration t2 data */
    int16_t dig_t2;

    /*! Calibration t3 data */
    int16_t dig_t3;

    /*! Calibration parameter of pressure data */

    /*! Calibration p1 data */
    uint16_t dig_p1;

    /*! Calibration p2 data */
    int16_t dig_p2;

    /*! Calibration p3 data */
    int16_t dig_p3;

    /*! Calibration p4 data */
    int16_t dig_p4;

    /*! Calibration p5 data */
    int16_t dig_p5;

    /*! Calibration p6 data */
    int16_t dig_p6;

    /*! Calibration p7 data */
    int16_t dig_p7;

    /*! Calibration p8 data */
    int16_t dig_p8;

    /*! Calibration p9 data */
    int16_t dig_p9;

    /*! Calibration p10 data */
    int8_t dig_p10;

    /*! Fine resolution temperature value */
    int32_t t_fine;
};

/*!
 * @brief Sensor configuration structure
 */
struct bmp2_config
{
    /*! Over-sampling of temperature data */
    uint8_t os_temp;

    /*! Over-sampling of pressure data */
    uint8_t os_pres;

    /*! Odr set by setting standby duration */
    uint8_t odr;

    /*! Over-sampling mode */
    uint8_t os_mode;

    /*! Time constant of IIR filter */
    uint8_t filter;

    /*! Enable 3-wire SPI interface */
    uint8_t spi3w_en;
};

/*!
 * @brief Sensor status structure
 */
struct bmp2_status
{
    /*! Data registers' status */
    uint8_t measuring;

    /*! Image register status */
    uint8_t im_update;
};

/*!
 * @brief Uncompensated data structure
 */
struct bmp2_uncomp_data
{
    /*! Uncompensated temperature data */
    int32_t temperature;

    /*! Uncompensated pressure data */
    uint32_t pressure;
};

/*!
 * @brief bmp2 sensor structure which comprises of temperature and pressure
 */
#ifdef BMP2_DOUBLE_COMPENSATION
struct bmp2_data
{
    /*! Compensated pressure */
    double pressure;

    /*! Compensated temperature */
    double temperature;
};
#else
struct bmp2_data
{
    /*! Compensated pressure */
    uint32_t pressure;

    /*! Compensated temperature */
    int32_t temperature;
};
#endif

/*!
 * @brief API device structure
 */
struct bmp2_dev
{
    /*! Chip Id */
    uint8_t chip_id;

    /*! SPI/I2C Interface selection */
    enum bmp2_intf intf;

    /*!
     * The interface pointer is used to enable the user
     * to link their interface descriptors for reference during the
     * implementation of the read and write interfaces to the
     * hardware.
     */
    void *intf_ptr;

    /*! Variable that holds result of read/write function */
    BMP2_INTF_RET_TYPE intf_rslt;

    /*! Bus read function pointer */
    bmp2_read_fptr_t read;

    /*! Bus write function pointer */
    bmp2_write_fptr_t write;

    /*! Delay(in us) function pointer */
    bmp2_delay_us_fptr_t delay_us;

    /*! Powermode of the sensor */
    uint8_t power_mode;

    /*! Structure of calibration parameters' */
    struct bmp2_calib_param calib_param;
};

#ifdef __cplusplus
}
#endif /* End of CPP guard */

#endif /* _BMP2_DEFS_H */